In [21]:
import pandas as pd
import numpy as np
import seaborn as sns

In [22]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
df.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [24]:
df.groupby(['sex','class'])['survived'].mean()

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_12924\3464163120.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class'])['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [25]:
df.groupby(['sex','class'])['survived'].agg(['mean','count'])

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_12924\327170654.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class'])['survived'].agg(['mean','count'])

                   mean  count
sex    class
female First   0.968085     94
       Second  0.921053     76
       Third   0.500000    144
male   First   0.368852    122
       Second  0.157407    108
       Third   0.135447    347

In [27]:
df.groupby(['sex','class'])[['survived','age']].agg({'survived':'mean' , 'age':'count'})

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_12924\82611723.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class'])[['survived','age']].agg({'survived':'mean' , 'age':'count'})

               survived  age
sex    class
female First   0.968085   85
       Second  0.921053   74
       Third   0.500000  102
male   First   0.368852  101
       Second  0.157407   99
       Third   0.135447  253

In [28]:
def get_IQR(data):
    _3rd=data.quantile(.75)
    _1st=data.quantile(.25)
    return(np.abs(_3rd - _1st)*1.5)

df.groupby(['sex','class'])['age'].apply(get_IQR)

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_12924\244875919.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class'])['age'].apply(get_IQR)

sex     class
female  First     31.5000
        Second    20.6250
        Third     23.4375
male    First     31.5000
        Second    20.6250
        Third     19.5000
Name: age, dtype: float64

In [29]:
df = sns.load_dataset('penguins')
df.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [31]:
df.groupby('species')[['bill_length_mm','bill_depth_mm','flipper_length_mm','body_mass_g']].apply(lambda x:x.fillna(x.mean()))

             bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
species
Adelie  0         39.100000      18.700000         181.000000  3750.000000
        1         39.500000      17.400000         186.000000  3800.000000
        2         40.300000      18.000000         195.000000  3250.000000
        3         38.791391      18.346358         189.953642  3700.662252
        4         36.700000      19.300000         193.000000  3450.000000
...                     ...            ...                ...          ...
Gentoo  339       47.504878      14.982114         217.186992  5076.016260
        340       46.800000      14.300000         215.000000  4850.000000
        341       50.400000      15.700000         222.000000  5750.000000
        342       45.200000      14.800000         212.000000  5200.000000
        343       49.900000      16.100000         213.000000  5400.000000

[344 rows x 4 columns]

In [33]:
df=pd.DataFrame({'group':['A','A','A','B','B'],
                 'value':[1,1,1,10,10]})
df

  group  value
0     A      1
1     A      1
2     A      1
3     B     10
4     B     10

In [35]:
df.groupby('group')['value'].sum() # ????? 그람 이게 시리즈야?? 디셔너리로 뽑힌거야? 뭐야???

group
A     3
B    20
Name: value, dtype: int64

In [36]:
df.groupby([0,0,0,1,1])['value'].sum()

0     3
1    20
Name: value, dtype: int64

In [38]:
s=pd.Series([False,False,True,True,True])
df.groupby(s)['value'].sum()

False     2
True     21
Name: value, dtype: int64